Merge remote-tracking branch 'apache/dev' into aminata-pr
